lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54lm20b/wiring_time.c
#include "Arduino.h"

#include <stdint.h>

#include "cmsis.h"
#include "nrf54lm20b.h"
#include "variant.h"

#if !defined(ARDUINO_XIAO_NRF54L15) && !defined(ARDUINO_XIAO_NRF54L15_CLEAN) && !defined(XIAO_NRF54L15_BOARD_STATE_DECLARED)
typedef struct {
    uint8_t unused;
} xiao_nrf54l15_board_state_t;
#endif

extern uint32_t SystemCoreClock;
extern void SystemCoreClockUpdate(void);
extern void nrf54l15_clean_idle_service(void);
extern uint8_t nrf54l15_bridge_serial_active(void) __attribute__((weak));
extern uint8_t nrf54l15_ble_idle_wake_consume(void) __attribute__((weak));
extern void nrf54l15_ble_grtc_irq_service(void) __attribute__((weak));
extern void nrf54l15_grtc_pwm_irq_service(void) __attribute__((weak));
extern uint32_t nrf54l15_ble_grtc_reserved_cc_mask(void) __attribute__((weak));
extern uint32_t nrf54l15_clean_ble_idle_sleep_cap_us(void) __attribute__((weak));
extern uint8_t nrf54l15_clean_low_power_micro_delay_sleep_allowed(void)
    __attribute__((weak));
uint32_t nrf54lm20b_core_enter_idle_cpu_scaling(void);
void nrf54lm20b_core_exit_idle_cpu_scaling(uint32_t previousRaw);
void nrf54lm20b_core_prepare_system_off_wake_timebase(void);
void nrf54lm20b_core_prepare_system_off(void);
void nrf54lm20b_core_disable_system_off_retention(void);

static volatile uint32_t g_millis_ticks = 0;
static volatile uint32_t* const kScbScr = (volatile uint32_t*)0xE000ED10UL;
static const uint32_t kScbScrSleepDeep_Msk = (1UL << 2);
static const uint32_t kScbScrSleepOnExit_Msk = (1UL << 1);
static const uint16_t kSystemOffTimeoutLfclk = 5U;
static const uint8_t kSystemOffWakeLeadLfclk = 4U;
static const uint32_t kSystemOffLfclkFrequencyHz = 32768UL;
static const uint32_t kSystemOffMaxCcLatchWaitUs = 77UL;
static const uint32_t kSystemOffMinimumLatencyGuardUs = 1000UL;
static const uint32_t kGrtcStartSettleUs = 93UL;
uint64_t nrf54lm20b_core_monotonic_time_us(void);
uint32_t nrf54lm20b_core_monotonic_time_ms(void);
#if defined(NRF54L15_CLEAN_POWER_LOW)
volatile uint32_t g_nrf54l15_diag_delay_outer_loops = 0U;
volatile uint32_t g_nrf54l15_diag_delay_wfi_entries = 0U;
volatile uint32_t g_nrf54l15_diag_delay_skipwfi_count = 0U;
volatile uint32_t g_nrf54l15_diag_delay_invalid_channel_count = 0U;
volatile uint32_t g_nrf54l15_diag_grtc_irq_count = 0U;
volatile uint32_t g_nrf54l15_diag_grtc_delay_irq_count = 0U;
volatile uint32_t g_nrf54l15_diag_ble_grtc_irq_service_count = 0U;
volatile uint32_t g_nrf54l15_diag_delay_skipwfi_total_us = 0U;
volatile uint32_t g_nrf54l15_diag_delay_skipwfi_max_us = 0U;
// Keep a small non-zero GRTC timeout. TIMEOUT=0 can miss/hold System ON
// compare wakeups on this bare-metal path and hang early setup delay() calls.
static const uint16_t kLowPowerDelayTimeoutLfclk = 5U;
static const uint8_t kLowPowerDelayWakeLfclk = 4U;
#if NRF54L15_GRTC_IRQ_GROUP == 2U
static const IRQn_Type kLowPowerTickIrq = GRTC_2_IRQn;
#elif NRF54L15_GRTC_IRQ_GROUP == 1U
static const IRQn_Type kLowPowerTickIrq = GRTC_1_IRQn;
#else
static const IRQn_Type kLowPowerTickIrq = GRTC_0_IRQn;
#endif
#endif
#if defined(ARDUINO_XIAO_NRF54L15) || defined(ARDUINO_XIAO_NRF54L15_CLEAN) || \
    defined(ARDUINO_NRF54LM20A) || defined(ARDUINO_NRF54LM20B) || \
    defined(ARDUINO_XIAO_NRF54LM20A_CLEAN) || defined(ARDUINO_XIAO_NRF54LM20B_CLEAN)
#define NRF54_CLEAN_XIAO_GRTC_RESTRICTED 1
#endif

#if defined(NRF54_CLEAN_XIAO_GRTC_RESTRICTED)
static const uint32_t kZephyrAllowedCcMaskXiao = 0x67UL;
static const uint8_t kZephyrMainCcChannelXiao = 1U;
#endif

static void disableSystemOffRetention(void)
{
    for (uint32_t i = 0; i < MEMCONF_POWER_MaxCount; ++i) {
        NRF_MEMCONF->POWER[i].RET = 0U;
        NRF_MEMCONF->POWER[i].RET2 = 0U;
    }
}

static void clearSystemOffVprRetention(void)
{
    if (MEMCONF_POWER_MaxCount > 1U) {
        NRF_MEMCONF->POWER[1U].RET &= ~MEMCONF_POWER_RET_MEM0_Msk;
    }
}

static uint32_t beginIdleSleep(void)
{
    const uint32_t restoreRaw = nrf54lm20b_core_enter_idle_cpu_scaling();
    *kScbScr &= ~(kScbScrSleepDeep_Msk | kScbScrSleepOnExit_Msk);
    return restoreRaw;
}

static void endIdleSleep(uint32_t restoreRaw)
{
    nrf54lm20b_core_exit_idle_cpu_scaling(restoreRaw);
}

static uint8_t highestSetBit(uint32_t mask)
{
    return (uint8_t)(31U - (uint32_t)__builtin_clz(mask));
}

static bool lfclkRunningFrom(uint32_t src)
{
    const uint32_t stat = NRF_CLOCK->LFCLK.STAT;
    const bool running =
        ((stat & CLOCK_LFCLK_STAT_STATE_Msk) >> CLOCK_LFCLK_STAT_STATE_Pos) ==
        CLOCK_LFCLK_STAT_STATE_Running;
    const uint32_t currentSrc =
        (stat & CLOCK_LFCLK_STAT_SRC_Msk) >> CLOCK_LFCLK_STAT_SRC_Pos;
    return running && (currentSrc == src);
}

static bool waitForLfclkStarted(uint32_t expectedSrc, uint32_t spinLimit)
{
    while (spinLimit-- > 0U) {
        if ((NRF_CLOCK->EVENTS_LFCLKSTARTED != 0U) &&
            lfclkRunningFrom(expectedSrc)) {
            return true;
        }
    }
    return false;
}

static void startLfclkSource(uint32_t src)
{
    NRF_CLOCK->EVENTS_LFCLKSTARTED = 0U;
    NRF_CLOCK->LFCLK.SRC =
        (src << CLOCK_LFCLK_SRC_SRC_Pos) & CLOCK_LFCLK_SRC_SRC_Msk;
    __asm volatile("dsb 0xF" ::: "memory");
    NRF_CLOCK->TASKS_LFCLKSTART = CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger;
}

static void ensureSystemOffLfxoRunning(void)
{
    // LFXO is not present on XIAO nRF54LM20B (no 32.768 kHz crystal).
    // Only LFRC is available. LFRC stops in SYSTEM OFF, so timed wake
    // is impossible. The caller (enterTimedSystemOff) checks LFXO status
    // and falls back to delayMicroseconds if LFXO isn't running.
    // Do NOT try to start LFXO — that would break the LFCLK state.
}

static uint32_t selectRunningGrtcLfClockSource(void)
{
    ensureSystemOffLfxoRunning();
    if (lfclkRunningFrom(CLOCK_LFCLK_STAT_SRC_LFXO)) {
        return GRTC_CLKCFG_CLKSEL_LFXO;
    }

    if (!lfclkRunningFrom(CLOCK_LFCLK_STAT_SRC_LFRC)) {
        startLfclkSource(CLOCK_LFCLK_SRC_SRC_LFRC);
        static const uint32_t kQuickLfrcLimit = 10000000UL;
        (void)waitForLfclkStarted(CLOCK_LFCLK_STAT_SRC_LFRC,
                                  kQuickLfrcLimit);
    }

