lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54lm20b/wiring_time.c
    const uint32_t grtcClockSel = selectRunningGrtcLfClockSource();

    uint32_t clkcfg = g_low_power_grtc->CLKCFG;
    clkcfg &= ~GRTC_CLKCFG_CLKSEL_Msk;
    clkcfg |= (grtcClockSel << GRTC_CLKCFG_CLKSEL_Pos) &
              GRTC_CLKCFG_CLKSEL_Msk;
    g_low_power_grtc->CLKCFG = clkcfg;

    g_low_power_grtc->TIMEOUT =
        (((uint32_t)kLowPowerDelayTimeoutLfclk << GRTC_TIMEOUT_VALUE_Pos) &
         GRTC_TIMEOUT_VALUE_Msk);
    g_low_power_grtc->WAKETIME =
        (((uint32_t)kLowPowerDelayWakeLfclk << GRTC_WAKETIME_VALUE_Pos) &
         GRTC_WAKETIME_VALUE_Msk);
    g_low_power_grtc->MODE =
        (GRTC_MODE_AUTOEN_CpuActive << GRTC_MODE_AUTOEN_Pos) |
        (GRTC_MODE_SYSCOUNTEREN_Enabled << GRTC_MODE_SYSCOUNTEREN_Pos);
    g_low_power_grtc->TASKS_START = GRTC_TASKS_START_TASKS_START_Trigger;

    // GRTC state can survive in ways that matter across debug/program cycles.
    // Clear the whole interrupt/event group before using the low-power delay
    // channel, or a stale compare event on another channel can trap the CPU in
    // the IRQ.
    const uint32_t bleReservedMask =
        (nrf54l15_ble_grtc_reserved_cc_mask != 0)
            ? nrf54l15_ble_grtc_reserved_cc_mask()
            : 0U;
    uint32_t availableMask = lowPowerAllCcMask() & ~bleReservedMask;
#if defined(NRF54_CLEAN_XIAO_GRTC_RESTRICTED)
    availableMask &= kZephyrAllowedCcMaskXiao;
#endif
    g_low_power_delay_channel =
        (availableMask != 0U) ? highestSetBit(availableMask)
                              : kLowPowerDelayInvalidChannel;
    NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
        0xFFFFFFFFUL & ~bleReservedMask;
    for (uint8_t channel = 0; channel < GRTC_CC_MaxCount; ++channel) {
        if ((bleReservedMask & (1UL << channel)) != 0U) {
            continue;
        }
        g_low_power_grtc->CC[channel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        g_low_power_grtc->EVENTS_COMPARE[channel] = 0U;
    }

    if (g_low_power_delay_channel != kLowPowerDelayInvalidChannel) {
        NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
            (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
        NVIC_SetPriority(kLowPowerTickIrq, 3U);
        NVIC_EnableIRQ(kLowPowerTickIrq);
    }
    g_low_power_timebase_initialized = 1U;
}

void nrf54lm20b_core_bootstrap_low_power_timebase(void)
{
    initLowPowerTimebase();
}

static void delayUntilLowPowerCounterUs(uint64_t targetUs)
{
    if ((__get_PRIMASK() & 1U) != 0U) {
        while ((int64_t)(targetUs - readLowPowerCounterUs()) > 0) {
            nrf54l15_clean_idle_service();
            __NOP();
        }
        return;
    }

    while ((int64_t)(targetUs - readLowPowerCounterUs()) > 0) {
        ++g_nrf54l15_diag_delay_outer_loops;
        nrf54l15_clean_idle_service();
        uint64_t sleepTargetUs = targetUs;
        uint8_t skipWfi = 0U;
        if (nrf54l15_clean_ble_idle_sleep_cap_us != 0) {
            // BLE link setup, scanning, and notify/ATT flows are pump-driven in
            // the current CPUAPP path. Sleep in short slices while BLE is
            // active so WFI idle does not starve that state machine.
            const uint32_t sleepCapUs = nrf54l15_clean_ble_idle_sleep_cap_us();
            if (sleepCapUs != 0U) {
                if (sleepCapUs == 1U) {
                    skipWfi = 1U;
                } else {
                const uint64_t cappedTargetUs =
                    readLowPowerCounterUs() + (uint64_t)sleepCapUs;
                if ((int64_t)(targetUs - cappedTargetUs) > 0) {
                    sleepTargetUs = cappedTargetUs;
                }
                }
            }
        }
        if (skipWfi != 0U) {
            const uint32_t skipStartUs = (uint32_t)readLowPowerCounterUs();
            ++g_nrf54l15_diag_delay_skipwfi_count;
            __NOP();
            const uint32_t skipElapsedUs =
                (uint32_t)(readLowPowerCounterUs() - (uint64_t)skipStartUs);
            g_nrf54l15_diag_delay_skipwfi_total_us += skipElapsedUs;
            if (skipElapsedUs > g_nrf54l15_diag_delay_skipwfi_max_us) {
                g_nrf54l15_diag_delay_skipwfi_max_us = skipElapsedUs;
            }
            continue;
        }
        if (g_low_power_delay_channel == kLowPowerDelayInvalidChannel) {
            ++g_nrf54l15_diag_delay_invalid_channel_count;
            __NOP();
            continue;
        }
        lowPowerArmDelayWake(sleepTargetUs);
        const uint32_t restoreRaw = beginIdleSleep();
        while ((g_low_power_delay_fired == 0U) &&
               ((int64_t)(sleepTargetUs - readLowPowerCounterUs()) > 0)) {
            ++g_nrf54l15_diag_delay_wfi_entries;
            __asm volatile("wfi");
            // BLE foreground wake (advertising) fires on a different
            // GRTC channel; break out of the inner WFI loop so
            // idle_service() can run maybeAdvertise() again.
            if (nrf54l15_ble_idle_wake_consume != 0 &&
                nrf54l15_ble_idle_wake_consume() != 0U) {
                break;
            }
        }
        endIdleSleep(restoreRaw);
        lowPowerDisarmDelayWake();
    }
}
#endif

#if NRF54L15_GRTC_IRQ_GROUP == 2U
void GRTC_2_IRQHandler(void)
#elif NRF54L15_GRTC_IRQ_GROUP == 1U
void GRTC_1_IRQHandler(void)
#else
void GRTC_0_IRQHandler(void)
#endif
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    ++g_nrf54l15_diag_grtc_irq_count;
    if (g_low_power_delay_channel != kLowPowerDelayInvalidChannel &&
        g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] != 0U) {
        ++g_nrf54l15_diag_grtc_delay_irq_count;
        g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
        g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
            (1UL << g_low_power_delay_channel);
        g_low_power_delay_fired = 1U;
    }
#endif
    if (nrf54l15_ble_grtc_irq_service != 0) {
#if defined(NRF54L15_CLEAN_POWER_LOW)
        ++g_nrf54l15_diag_ble_grtc_irq_service_count;
#endif
        nrf54l15_ble_grtc_irq_service();
    }
    if (nrf54l15_grtc_pwm_irq_service != 0) {
        nrf54l15_grtc_pwm_irq_service();
    }
}

static uint8_t delayBoardStateEnter(xiao_nrf54l15_board_state_t* state)
{
#if defined(ARDUINO_XIAO_NRF54L15) || defined(ARDUINO_XIAO_NRF54L15_CLEAN)
    if (state == 0 || xiaoNrf54l15SaveBoardState(state) == 0U) {
        return 0U;
    }

    xiaoNrf54l15EnterLowestPowerBoardState();
    // Battery/IMU reads can use a short delay() as a settle window. Keep
    // those user-held rails alive while still collapsing the rest of the XIAO
    // board state.
    if (state->batteryEnable.isOutput != 0U &&
        state->batteryEnable.outputHigh != 0U) {
        (void)arduinoXiaoNrf54l15SetBatteryEnable(1U);
    }
    if (state->imuMicEnable.isOutput != 0U &&
        state->imuMicEnable.outputHigh != 0U) {
        (void)arduinoXiaoNrf54l15SetImuMicEnable(1U);
    }
    return 1U;
#else
    (void)state;
    return 0U;
#endif
}

static void delayBoardStateExit(const xiao_nrf54l15_board_state_t* state, uint8_t active)
{
#if defined(ARDUINO_XIAO_NRF54L15) || defined(ARDUINO_XIAO_NRF54L15_CLEAN)
    if (active != 0U) {
        (void)xiaoNrf54l15RestoreBoardState(state);
    }
#else
    (void)state;
    (void)active;
#endif
}

static uint8_t delayAutoBoardStateEnabled(void)
{
#if defined(ARDUINO_XIAO_NRF54L15) || defined(ARDUINO_XIAO_NRF54L15_CLEAN)
    return (nrf54l15_bridge_serial_active == 0 ||
            nrf54l15_bridge_serial_active() == 0U) ? 1U : 0U;
#else
    return 0U;
#endif
}

static uint8_t systemOffWakeChannel(void)
{
#if defined(NRF54_CLEAN_XIAO_GRTC_RESTRICTED)
    const uint32_t available =
        kZephyrAllowedCcMaskXiao & ~(1UL << kZephyrMainCcChannelXiao);
    return highestSetBit(available);
#else
    return 1U;
#endif
}

void nrf54lm20b_core_prepare_system_off_wake_timebase(void)
{
    NRF_GRTC_Type* const grtc = NRF_GRTC;
    NRF54L15_GRTC_INTENCLR_REG(grtc) = 0xFFFFFFFFUL;
    for (uint8_t channel = 0U; channel < GRTC_CC_MaxCount; ++channel) {
        grtc->CC[channel].CCEN =
            (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
        grtc->EVENTS_COMPARE[channel] = 0U;
    }

