lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54lm20b/wiring_time.c
    xiao_nrf54l15_board_state_t boardState;
    const uint8_t boardStateActive =
        delayAutoBoardStateEnabled() ? delayBoardStateEnter(&boardState) : 0U;
    initLowPowerTimebase();
    // Keep plain delay() Arduino-compatible for user-held settle rails such as
    // VBAT_EN and IMU_MIC_EN while still collapsing XIAO RF_SW for low idle
    // current. BLE paths that need RF_SW during radio events should use the
    // BoardControl/BleRadio helpers rather than holding it through delay().
    // On XIAO, auto-collapse only when the USB bridge UART is idle. That keeps
    // plain delay() low-current for idle sketches while avoiding garbling
    // active bridge-backed Serial sessions.
    const uint64_t targetUs = readLowPowerCounterUs() + ((uint64_t)ms * 1000ULL);
    delayUntilLowPowerCounterUs(targetUs);
    delayBoardStateExit(&boardState, boardStateActive);
#else
    const unsigned long start = millis();
    while ((millis() - start) < ms) {
        nrf54l15_clean_idle_service();
        __NOP();
    }
#endif
}

void delayLowPowerIdle(unsigned long ms)
{
    if (ms == 0UL) {
        nrf54l15_clean_idle_service();
        return;
    }

    xiao_nrf54l15_board_state_t boardState;
    const uint8_t boardStateActive = delayBoardStateEnter(&boardState);

#if defined(NRF54L15_CLEAN_POWER_LOW)
    initLowPowerTimebase();
    const uint64_t targetUs = readLowPowerCounterUs() + ((uint64_t)ms * 1000ULL);
    delayUntilLowPowerCounterUs(targetUs);
#else
    const unsigned long start = millis();
    while ((millis() - start) < ms) {
        nrf54l15_clean_idle_service();
        if ((__get_PRIMASK() & 1U) != 0U) {
            __NOP();
            continue;
        }

        const uint32_t restoreRaw = beginIdleSleep();
        __asm volatile("wfi");
        endIdleSleep(restoreRaw);
    }
#endif

    delayBoardStateExit(&boardState, boardStateActive);
}

void delaySystemOff(unsigned long ms)
{
    uint32_t delayUs = (uint32_t)ms;
    if (delayUs > (0xFFFFFFFFUL / 1000UL)) {
        delayUs = 0xFFFFFFFFUL / 1000UL;
    }
    enterTimedSystemOff(false, delayUs * 1000UL);
}

void delaySystemOffNoRetention(unsigned long ms)
{
    uint32_t delayUs = (uint32_t)ms;
    if (delayUs > (0xFFFFFFFFUL / 1000UL)) {
        delayUs = 0xFFFFFFFFUL / 1000UL;
    }
    enterTimedSystemOff(true, delayUs * 1000UL);
}

void delayMicroseconds(unsigned int us)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    // Keep short timing waits busy/precise. Connected BLE paths can opt long
    // waits into tickless idle so 1 ms marker/settle delays do not burn CPU.
    if ((uint32_t)us >= kLowPowerMicroDelaySleepThresholdUs &&
        g_low_power_micro_delay_active == 0U &&
        nrf54l15_clean_low_power_micro_delay_sleep_allowed != 0 &&
        nrf54l15_clean_low_power_micro_delay_sleep_allowed() != 0U &&
        (__get_PRIMASK() & 1U) == 0U &&
        __get_IPSR() == 0U) {
        xiao_nrf54l15_board_state_t boardState;
        g_low_power_micro_delay_active = 1U;
        const uint8_t boardStateActive =
            delayAutoBoardStateEnabled() ? delayBoardStateEnter(&boardState) : 0U;
        initLowPowerTimebase();
        const uint64_t targetUs =
            readLowPowerCounterUs() + (uint64_t)((uint32_t)us);
        delayUntilLowPowerCounterUs(targetUs);
        delayBoardStateExit(&boardState, boardStateActive);
        g_low_power_micro_delay_active = 0U;
        return;
    }
#endif

    const unsigned long start = micros();
    while ((micros() - start) < (unsigned long)us) {
        __NOP();
    }
}

void nrf54lm20b_core_prepare_system_off(void)
{
#if defined(NRF54L15_CLEAN_POWER_LOW)
    if (g_low_power_timebase_initialized != 0U) {
        if (g_low_power_delay_channel != kLowPowerDelayInvalidChannel) {
            NRF54L15_GRTC_INTENCLR_REG(g_low_power_grtc) =
                (1UL << g_low_power_delay_channel);
            g_low_power_grtc->CC[g_low_power_delay_channel].CCEN =
                (GRTC_CC_CCEN_ACTIVE_Disable << GRTC_CC_CCEN_ACTIVE_Pos);
            g_low_power_grtc->EVENTS_COMPARE[g_low_power_delay_channel] = 0U;
        }
        NVIC_DisableIRQ(kLowPowerTickIrq);
        NVIC->ICPR[((uint32_t)kLowPowerTickIrq) >> 5U] =
            (1UL << (((uint32_t)kLowPowerTickIrq) & 0x1FUL));
    }
#endif

    clearSystemOffVprRetention();
#if defined(ARDUINO_XIAO_NRF54L15) || defined(ARDUINO_XIAO_NRF54L15_CLEAN)
    xiaoNrf54l15EnterLowestPowerBoardState();
#endif
    SysTick->CTRL = 0U;
}

void nrf54lm20b_core_disable_system_off_retention(void)
{
    disableSystemOffRetention();
}
